LEXICON: dict[str, str] = {
    'greeting': 'Привет, меня зовут Телеквиз бот\nС помощью меня ты можешь создавать квизы и тесты, смотреть '
                'статистику их прохождений',
    'about_bot': 'Данный бот был создан в рамках курсового проекта студентом 2 курса',
    'main_menu': '☰Главное меню',
    'find_session': '🔎Ввести код сессии',
    'create_quiz': '🔨Создать квиз',
    'create_test': '🔨Создать тест',
    'my_profile': '🧑‍💻Мой профиль',
    'my_quizzes': '📕Мои квизы',
    'my_tests': '📘Мои тесты',
    'statistics': '📊Статистика',
    'go_back': '↩Назад',
    'cancel': '❌Отмена',
    'edit': '✏️Редактировать',
    'delete_question': '🗑️Удалить вопрос',
    'cancel_edit': '✏️Отменить редактирование',
    'new_question': '➕Новый вопрос',
    'ready': '✅Готово',
    'backward': '<',
    'forward': '>',
    'double_backward': '<<',
    'double_forward': '>>',
    'cross_emoji': '❌',
    'tick': '✓',
    'ask_for_quiz_name': f"<b>Придумайте и отправьте название квиза</b>\n\n"
                         f"В любой момент Вы можете прописать команду "
                         f"<b>/cancel</b> "
                         f" или нажать на кнопку \"❌Отмена\", "
                         "чтобы прекратить создавание квиза, но в таком случае <u>не сохранится</u>",
    'ask_for_test_name': f"<b>Придумайте и отправьте название теста</b>\n\n"
                         f"В любой момент Вы можете прописать команду "
                         f"<b>/cancel</b> "
                         f" или нажать на кнопку \"❌Отмена\", "
                         "чтобы прекратить создавание квиза, но в таком случае данные <u>не сохранятся</u>",
    'choose_time_limit': "Выберите временное ограничение на каждый вопрос"
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': 'Начать работу с ботом',
    '/menu': 'Главное меню',
    '/cancel': 'Прекратить создавание квиза/теста',
    '/about': 'Информация о боте',
}
